<?php
namespace Collector\EntityBundle\Utils;


class Converter {
    public static function convertText($text){
        mb_language("Ja");
        mb_internal_encoding("utf-8");
        $rtn = mb_convert_kana($text,"SaK");
        $rtn = strtoupper($rtn);
        $replaces = array(
            "!"  => "！",
            " "  => "　",
            "#"  => "＃",
            "$"  => "＄",
            "%"  => "％",
            "&"  => "＆",
            "'"  => "’",
            "("  => "（",
            ")"  => "）",
            "*"  => "＊",
            "+"  => "＋",
            ","  => "，",
            "-"  => "ー",
            "―" => "ー",
            "ー" => "ー",
            "‐" => "ー",
            "."  => "．",
            "/"  => "／",
            ":"  => "：",
            ";"  => "；",
            "<"  => "＜",
            "="  => "＝",
            ">"  => "＞",
            "?"  => "？",
            "＠" => "@",
            "["  => "[",
            "\\" => "￥",
            "]"  => "］",
            "^"  => "＾",
            "_"  => "＿",
            "{"  => "｛",
            "|"  => "｜",
            "}"  => "｝",
            "ァ" => "ア",
            "ィ" => "イ",
            "ゥ" => "ウ",
            "ェ" => "エ",
            "ォ" => "オ",
            "ヵ" => "カ",
            "ｧ"  => "ア",
            "ｨ"  => "イ",
            "ｩ"  => "ウ",
            "ｪ"  => "エ",
            "ｫ"  => "オ",
            "ヰ" => "イ",
            "ヱ" => "エ",
            "ヶ" => "ケ",
            "ッ" => "ツ",
            "ｯ"  => "ツ",
            "ャ" => "ヤ",
            "ュ" => "ユ",
            "ョ" => "ヨ",
            "ｬ"  => "ヤ",
            "ｭ"  => "ユ",
            "ｮ"  => "ヨ",
            "ヮ" => "ワ",
            "ぁ" => "あ",
            "ぃ" => "い",
            "ぅ" => "う",
            "ぇ" => "え",
            "ぉ" => "お",
            "っ" => "つ",
            "ゃ" => "や",
            "ゅ" => "ゆ",
            "ょ" => "よ",
            "ゎ" => "わ",
            "ゐ" => "い",
            "ゑ" => "え",
        );
        $rtn = strtr($rtn,$replaces);
        return $rtn;
    }
}